//==================================================================
//
// バレット処理 [bullet.cpp]
// Auther : 杉本幸宏
//
//==================================================================

#include "main.h"
#include "bullet.h"

#include "game.h"	// ゲーム


//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// コンストラクタ・デストラクタ
//=============================================================================
CBullet::CBullet()	// コンストラクタ
{
	Init();	// 初期化
}

CBullet::~CBullet()	// デストラクタ
{

}



//=============================================================================
// 初期化処理
// 引数	：	テクスチャのファイル名, 横分割数, 縦分割数, アニメーションのWait値
//=============================================================================
void CBullet::Init(char* pTextureName, int TexDivX, int TexDivY, int AnimWait)
{
	//テクスチャ生成
	if ( pTextureName ) CreateTexture(pTextureName, &m_Texture);

	// メンバ変数の初期化
	m_TexBullet.Init();	// テクスチャの初期化
	m_Position = ZERO_VECTOR2;
	m_Size = ZERO_VECTOR2;
	m_Move = ZERO_VECTOR2;
	m_fAttack = 0.0f;
	m_bUse = false;		// false(未使用)で初期化

	// アニメーション情報のセット
	m_TexBullet.SetTexDivideX(TexDivX);	// 分割数（横）
	m_TexBullet.SetTexDivideY(TexDivY);	// 分割数（縦）
	m_TexBullet.SetAnimWait(AnimWait);	// アニメーションの切り替えフレーム値
}



//=============================================================================
// 終了処理
//=============================================================================
void CBullet::Uninit()
{
	// メンバ変数の終了処理
	m_bUse = false;		// false(未使用)にセット
	m_fAttack = 0.0f;
	m_Move = ZERO_VECTOR2;
	m_Size = ZERO_VECTOR2;
	m_Position = ZERO_VECTOR2;
	m_TexBullet.Uninit();	// テクスチャの終了処理

	// テクスチャ解放
	ReleaseTexture(m_Texture);
	m_Texture = NULL;	// 解放したのでNULLをセット
}



//=============================================================================
// 更新処理
// 引数	：	ステージの大きさ
//=============================================================================
void CBullet::Update(D3DXVECTOR2 StageSize)
{
	// このバレットが使われていないなら終了
	if (!m_bUse) return;

	// アニメーション
	m_TexBullet.UpdateAnimIndex(0, m_TexBullet.GetTexDivideX() * m_TexBullet.GetTexDivideY());	// 最初から最後まで一気にアニメーション

	// 移動を反映
	m_Position += m_Move;

	// ステージ外にいったら、このバレットを解放
	if ( (m_Position.x + (m_Size.x * 0.5f) ) < 0.0f)		UnsetBullet();	// 右端の点が、ステージ左端を超えたら解放
	if ( (m_Position.x - (m_Size.x * 0.5f) ) > StageSize.x)	UnsetBullet();	// 左端の点が、ステージ右端を超えたら解放
	if ( (m_Position.y + (m_Size.y * 0.5f) ) < 0.0f)		UnsetBullet();	// 下端の点が、ステージ上端を超えたら解放
	if ( (m_Position.y - (m_Size.y * 0.5f) ) > StageSize.y)	UnsetBullet();	// 上端の点が、ステージ下端を超えたら解放
}



//=============================================================================
// 描画処理
// 引数	：	スクロール座標
//=============================================================================
void CBullet::Draw(D3DXVECTOR2 ScrollPos)
{
	// このバレットが使われていないなら終了
	if (!m_bUse) return;

	//------------------- テクスチャ描画
	m_TexBullet.SetTexPos(m_Position - ScrollPos);	// 表示座標のセット
	m_TexBullet.DrawTexture(m_Texture);				// 描画
}



//=============================================================================
// バレットの発射設定
//=============================================================================
bool CBullet::SetBullet(D3DXVECTOR2 Pos, D3DXVECTOR2 Size, D3DXVECTOR2 Move, float Attack, float HP)
{
	// 既に使用中なら失敗を返す
	if (m_bUse) return (false);

	m_Position = Pos;	// 出現させる位置をセット
	m_Size = Size;		// 大きさをセット
	m_Move = Move;		// 移動量をセット
	m_fAttack = Attack;	// 攻撃力をセット
	m_bUse = true;		// true(使用中)をセット
}

//=============================================================================
// 使用中バレットの解放
//=============================================================================
bool CBullet::UnsetBullet()
{
	// 既に未使用なら失敗を返す
	if (!m_bUse) return (false);

	m_bUse = false;	// 未使用にする
}