//=============================================================================
//
// エネミー処理 [enemy.h]
// Author : 稲垣佑二郎
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ENEMY_MAX		(5)		// エネミーのMax人数



//*****************************************************************************
// クラス
//*****************************************************************************
class CEnemy
{
public:
	CEnemy();
	~CEnemy();

	void Update();
	void Draw();

private:
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	float			w, h;			// 幅と高さ
	float			time;			// 線形補間の時間管理用
	int				countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	bool			left;			// true:左へ移動
	bool			use;			// true:使っている  false:未使用
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

//ENEMY *GetEnemy(void);


