//==================================================================
//
// ファイヤーブーツ処理 [fireboots.cpp]
// Auther : 杉本幸宏
//
//==================================================================

#include "main.h"
#include "fireboots.h"

//==================================================================
// コンストラクタ・デストラクタ
//==================================================================
CFireBoots::CFireBoots()	// コンストラクタ
{
	Init();	// 初期化する
}

CFireBoots::~CFireBoots()	// デストラクタ
{

}



//==================================================================
// 初期化処理
//==================================================================
void CFireBoots::Init(char* pTextureName, int TexDivX, int TexDivY, int AnimWait)	// 初期化処理
{
	// バレットの初期化
	for (int i = 0; i < BULLET_NUM; i++)
	{
		m_Bullet[i].Init(pTextureName, TexDivX, TexDivY, AnimWait);
	}

}



//==================================================================
// 終了処理
//==================================================================
void CFireBoots::Uninit()
{
	// バレットの解放
	for (int i = 0; i < BULLET_NUM; i++)
	{
		m_Bullet[i].Uninit();
	}

}



//==================================================================
// 更新処理
//==================================================================
void CFireBoots::Update()
{
	
}
