//==================================================================
//
// ファイヤーブーツ処理 [fireboots.cpp]
// Auther : 杉本幸宏
//
//==================================================================
#pragma once

#include "player.h"	// プレイヤー
#include "bullet.h"	// バレット

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BULLET_NUM		(3)

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CFireBoots
{
public:
	CFireBoots();	// コンストラクタ
	~CFireBoots();	// デストラクタ

	void Init(char* pTextureName = NULL, int TexDivX = 1, int TexDivY = 1, int AnimWait = 0);	// 初期化処理
	void Uninit();	// 終了処理
	void Update();	// 更新処理
	void Draw();	// 描画処理

	//------------------- セッター関数
	void SetFireBoots(CPlayer* User);	// プレイヤーにガンブーツをセット

	//------------------- ゲッター関数


private:
	CBullet m_Bullet[BULLET_NUM];	// ガンブーツで下方向に飛ばすバレット
	CPlayer* m_pUser;				// このガンブーツを装着しているプレイヤーへのポインタ
	int m_nUsedBulletNum;			// 既に発射したバレットの数
};


