//==================================================================
// マップチップ処理 [mapchip.h]
// Auther : 杉本幸宏
//==================================================================
#pragma once


//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMapchip
{
public:
	CMapchip();			// コンストラクタ
	~CMapchip();		// デストラクタ

	//------------------- メンバ関数
	void Draw();		// 描画処理
	void Update();		// 更新処理

private:
	D3DXVECTOR2		m_vPosition;				// マップチップ変数の座標
	int				m_nIndLink_y, indLink_x;	// マップチップ配列の添字の保存(yは二次元目、xは一次元目)
	int				m_nChipNum;				// マップチップの番号
	bool			m_bUse;					// このマップチップ変数が使われているか
	float			m_fHp;
};



//*****************************************************************************
// プロトタイプ定義
//*****************************************************************************


