//=============================================================================
//
// タイトル画面処理 [opening.h]
// Author : 立石大智
//
//=============================================================================
#pragma once

#include "texture.h"	// テクスチャ描画処理

//*****************************************************************************
// 列挙型(enum)定義
//*****************************************************************************
enum
{
	OPENING_TEX_Bg,			// 背景テクスチャ(TexNo：0)
	OPENING_TEX_Logo,		// ロゴテクスチャ(TexNo：1)
	OPENING_TEX_Score,		// スコア表示テクスチャ(TexNo：2)

	OPENING_TEX_PATTARN_MAX	// リザルト画面で使用されているテクスチャの総数

};


//*****************************************************************************
// クラス定義
//*****************************************************************************
class CModeOpening
{
public:
	//------------------- メンバ関数
	void Init();		// 初期化処理
	void Uninit();		// 終了処理
	void Update();		// 更新処理
	void Draw();		// 描画処理

private:
	//------------------- メンバ変数（インスタンス）
	CTexture	m_OpeningTex[OPENING_TEX_PATTARN_MAX];		// ロゴ
							// ↑ 使用する画像の種類の数、配列を用意


	/*
	Tex →　"Texture"の略 
	*/
};

