//=============================================================================
//
// オープニング画面処理 [opening.cpp]
// Author : 立石大智
//
//=============================================================================
#include "main.h"
#include "opening.h"

#include "renderer.h"
#include "input.h"		// キー・ゲームパッド入力
#include "fade.h"		// フェード
//#include "sound.h"	// サウンド



//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NEXT_MODE		MODE_TITLE		// 次のモードを指定


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static ID3D11ShaderResourceView	*g_Texture[RESULT_TEX_PATTARN_MAX] = { NULL };	// テクスチャ情報


static char *g_TexturName[] = {
	/* 【重要】ここの順番は、ヘッダーに記載されてるenumの順番と揃えること！！！！！ */
	"data/TEXTURE/bg_opening.jpg",	// TexNo：0
};

//=============================================================================
// 初期化処理
//=============================================================================
void CModeOpening::Init()
{
	//------------------- ①テクスチャ生成

	//------------------- ②メンバ変数の初期化

	/*
	テクスチャを描画する際は、
		１.テクスチャのサイズ
		２.テクスチャの描画位置
	の二つの情報を指定してあげる必要があるよ！
	指定しないと、サイズは０ということで、描画はしてるけど、横0,縦0 のテクスチャを描画しちゃうから画像が見えない！

	「描画できない」って思ったら、初期化の段階でサイズと描画位置を指定してないことをまず疑おう！
	*/
}

//=============================================================================
// 終了処理
//=============================================================================
void CModeOpening::Uninit(void)
{
	//------------------- Init()で生成したテクスチャを解放




}

//=============================================================================
// 更新処理
//=============================================================================
void CModeOpening::Update(void)
{
#ifdef _DEBUG
	//------------------- キー・ゲームパットでの入力で次のモードへ
	if (KEY_MODE_CHANGE)
	{// Enter押したら、ステージを切り替える
		SetFade(FADE_OUT, NEXT_MODE);	// フェードして次のモードへ
	//	SetMode(NEXT_MODE);				// 次のモードにシーン遷移
	}
	// ゲームパッドで入力処理
	else if (PAD_MODE_CHANGE)
	{
		SetFade(FADE_OUT, NEXT_MODE);	// フェードして次のモードへ
	//	SetMode(NEXT_MODE);				// 次のモードにシーン遷移
	}
#endif // _DEBUG


	/* 以下、各テクスチャごとに更新処理があれば記入 */


}

//=============================================================================
// 描画処理
//=============================================================================
void CModeOpening::Draw(void)
{
	// 描画の前準備( PresetDraw2D() を呼び出そう！)

	// 全てのテクスチャを描画
	for (int i = 0; i < RESULT_TEX_PATTARN_MAX; i++)
	{
		// 描画( DrawTexture() を呼び出そう！)

	}
}
