//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : 立石大智, 杉本幸宏
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PLAYER_MAX		(1)			// プレイヤーのMax人数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CPlayer //: public CTexture
{
public:
	CPlayer();						// コンストラクタ
	~CPlayer();						// デストラクタ

	//HRESULT Init();
	//void Uninit();
	void Update();
	void Draw();

private:
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	float			w, h;			// 幅と高さ
	int				countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	bool			use;			// true:使っている  false:未使用
//	bool			left;			// true:左へ移動

};

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct PLAYER
{
	bool			use;			// true:使っている  false:未使用
	float			w, h;			// 幅と高さ
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	int				countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	bool			left;			// true:左へ移動
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

//PLAYER *GetPlayer(void);