//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : GP11A132 24 立石大智
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PLAYER_MAX		(1)		// プレイヤーのMax人数



//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct PLAYER
{
	bool			use;			// true:使っている  false:未使用
	float			w, h;			// 幅と高さ
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	int				countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	bool			left;			// true:左へ移動
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

PLAYER *GetPlayer(void);


