//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : 立石大智, 杉本幸宏
//
//=============================================================================
#pragma once

#include "texture.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PLAYER_MAX		(1)			// プレイヤーのMax人数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CPlayer : public CTexture
{
public:
	CPlayer();							// コンストラクタ
	~CPlayer();							// デストラクタ

	//------------------- メンバ関数
	void Init();						// 初期化
	//void Uninit();					// 終了処理
	void Update();						// 更新処理
	void Draw();						// 描画処理

	//------------------- セッター関数
	void SetPlayerUseFlag(bool Use);	// プレイヤーのuseフラグのセット
	void KillPlayer();					// プレイヤーを殺す処理

	//------------------- セッター関数
	bool GetPlayerUseFlag();			// プレイヤーのuseフラグの取得

	//------------------- マクロ定義
	#define PLAYER_ALIVE	SetPlayerUseFlag(true)	// プレイヤーを生き返らせる

private:
	//------------------- メンバ変数
	int				m_nTexNo;			// テクスチャ番号
	bool			m_bUse;				// true:使っている  false:未使用
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

//PLAYER *GetPlayer(void);