//=============================================================================
//
// 毒処理 [poison.cpp]
// Author : 杉本幸宏
//
//=============================================================================

#include "main.h"
#include "poison.h"

#include "game.h"

// コンストラクタ
CPoison::CPoison()
{
	Init();
}

// デストラクタ
CPoison::~CPoison()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
void CPoison::Init(D3DXVECTOR2* myLegPos, float* myHP, float Attack, int Wait)
{
//	m_pMapchipInf = Mapchip;	// マップチップ情報のセット
	m_pLegPosition = myLegPos;	// キャラクタの座標の情報をセット
	m_pHitPointInf = myHP;		// キャラクタHPへのアクセス
	m_fAttack = Attack;			// 毒の攻撃力のセット
	m_nFlameCnt = 0;			// 経過フレームはゼロ
	m_nFlameWait = Wait;		// wait値をセット
}



//=============================================================================
// 終了処理
//=============================================================================
void CPoison::Uninit()
{
//	m_pMapchipInf = NULL;			// マップチップ情報のセット
	m_pLegPosition = NULL;			// キャラクタの座標の情報をセット
	m_pHitPointInf = NULL;			// キャラクタHPへのアクセス
	m_nFlameCnt = m_nFlameWait = 0;	// 経過フレームに関する変数を初期化
}



//=============================================================================
// 更新処理
//=============================================================================
void CPoison::Update()
{
	// 経過フレーム数を加算
	m_nFlameCnt++;

	// 体力を削るフレームになったとき
	if (m_nFlameCnt >= m_nFlameWait)
	{
		// 体力削る
		*m_pHitPointInf -= m_fAttack;

		// 経過フレーム数をリセット
		m_nFlameCnt = 0;
	}

}