//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : 杉本幸宏
//
//=============================================================================
#pragma once

#include "texture.h"


//*****************************************************************************
// enum
//*****************************************************************************
enum
{
	RESULT_TEX_Bg,			// 背景テクスチャ(TexNo：0)
	RESULT_TEX_Logo,		// ロゴテクスチャ(TexNo：1)
	RESULT_TEX_Score,		// スコア表示テクスチャ(TexNo：2)

	RESULT_TEX_PATTARN_MAX	// リザルト画面で使用されているテクスチャの総数
};


//*****************************************************************************
// クラス定義
//*****************************************************************************
class CModeResult
{
public:
	void Init();	// 初期化処理
	void Uninit();	// 終了処理
	void Update();	// 更新処理
	void Draw();	// 描画処理

private:
	CTexture m_Tex[RESULT_TEX_PATTARN_MAX];	// 使用テクスチャ(上のenumのパターン数だけ用意)

};
