//=============================================================================
//
// スコア処理 [score.h]
// Author : 杉本幸宏
//
//=============================================================================
#pragma once

#include "texture.h"	// テクスチャ

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	SCORE_MAX			(99999)		// スコアの最大値
#define	SCORE_DIGIT			(5)			// 表示する最大桁数
#define	DIGIT_DECIMAL		(1)			// 表示する小数点以下の桁数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CScore
{
public:

	//------------------- メンバ関数
	void Init(char* pTexName, D3DXVECTOR2 TexSize);	// 初期化
	void Uninit();	// 終了処理
	void Update(int FlameCnt);	// 更新処理
	void Draw(D3DXVECTOR2 Pos);	// 描画処理

	// スコアの加算
	void AddScore(int Add);

	// スコアを直接代入
	void SetScore(int Score) { m_nScore = Score; };

	// 現在のスコアを取得
	int GetScore() { return m_nScore; };

private:
	CTexture m_Texture;
	int m_nScore;	// 現在のスコア
};
