//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 杉本幸宏
//
//=============================================================================
#pragma once

#include "texture.h"	// テクスチャ

//*****************************************************************************
// enum
//*****************************************************************************
enum
{
	TITLE_TEX_bg,		// 背景
	TITLE_TEX_logo,		// タイトルロゴ

	TITLE_TEX_MAX
};

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//------------------- 背景
#define TITLE_BG_COLOR		D3DXCOLOR(0.3f, 0.3f, 1.0f, 1.0f)	// 背景の色

//------------------- "Newtrization"ロゴ
#define TITLE_LOGO_SIZE		D3DXVECTOR2(700.0f, 200.0f)			// ロゴサイズ
#define TITLE_LOGO_POS		D3DXVECTOR2(480.0f, 150.0f)			// ロゴ位置
#define TITLE_LOGO_COLOR	D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f)	// ロゴの色

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CModeTitle
{
public:
//	CTitle();	// コンストラクタ
//	~CTitle();	// デストラクタ

	void Init();	// 初期化処理
	void Uninit();	// 終了
	void Update();	// 更新処理
	void Draw();	// 描画処理

	// テクスチャのサイズ・描画位置・色を個別で設定
	void SetTitleTexInf();

private:
	CTexture m_Texture[TITLE_TEX_MAX];	// テクスチャインスタンス

};

//CTitle::CTitle()
//{
//}
//
//CTitle::~CTitle()
//{
//}

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
//HRESULT InitTitle(void);
//void UninitTitle(void);
//void UpdateTitle(void);
//void DrawTitle(void);
