//=============================================================================
//
// UI処理 [userInterface.h]
// Author : 杉本幸宏
//
//=============================================================================
#pragma once

#include "texture.h"

//*****************************************************************************
// enum
//*****************************************************************************
enum
{
	UI_TEX_TYPE_HPgage,			// プレイヤーのHPゲージ
	UI_TEX_TYPE_HPgage_Cover,	// プレイヤーのHPゲージの装飾
//	UI_TEX_TYPE_Player_PoisonIcon,	// プレイヤーの毒状態アイコン

	UI_TEX_TYPE_MAX				// 使用するテクスチャの数
}; // GAME_UI_TEXTURE_TYPE;	// ゲーム画面のUIで使用するテクスチャの種類

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define HP_GAGE_WIDTH			275.0f		// HPゲージ本体の横幅
#define HP_GAGE_HEIGHT			23.0f		// HPゲージ本体の縦幅
#define HP_GAGE_COLOR			D3DXCOLOR(0.0f, 1.0f, 0.0f, 1.0f)		// HPゲージ本体の超転職

#define HP_GAGE_COVER_WIDTH		300.0f		// HPゲージカバーの横幅
#define HP_GAGE_COVER_HEIGHT	50.0f		// HPゲージカバーの縦幅

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGameUI	// ユーザーインターフェース クラス
{
public:
	CGameUI();		// コンストラクタ
	~CGameUI();		// デストラクタ

	//------------------- メンバ関数
	void Init();	// 初期化処理
	void Uninit();	// 終了処理
	void Update();	// 更新処理
	void Draw();	// 描画処理

private:
	//------------------- メンバ変数
	CTexture m_Texture[UI_TEX_TYPE_MAX];	// 使用テクスチャ

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void CreateGameUITexture(void);		// テクスチャの生成
void ReleaseGameUITexture(void);	// テクスチャの解放
